{
  "posts": [
    {
      "id": 1,
      "title": "Introduction to React",
      "date": "2024-08-01",
      "body": "React is a JavaScript library for building user interfaces. It allows developers to create single-page applications with a component-based architecture."
    },
    {
      "id": 2,
      "title": "Understanding JavaScript Closures",
      "date": "2024-08-15",
      "body": "Closures are a fundamental concept in JavaScript. They allow a function to retain access to its lexical scope even after the function has finished executing."
    },
    {
      "id": 3,
      "title": "Getting Started with Node.js",
      "date": "2024-09-01",
      "body": "Node.js is a runtime environment that allows you to execute JavaScript code on the server side. It's built on the V8 JavaScript engine and is designed for building scalable network applications."
    },
    {
      "id": 4,
      "title": "CSS Grid Layout Basics",
      "date": "2024-09-10",
      "body": "CSS Grid Layout is a powerful tool for creating complex web layouts. It allows for precise placement of elements in a grid format, simplifying the design of responsive layouts."
    },
    {
      "id": 5,
      "title": "Introduction to REST APIs",
      "date": "2024-09-15",
      "body": "REST APIs allow communication between different software systems over HTTP. They use standard HTTP methods and status codes to perform operations like CRUD (Create, Read, Update, Delete)."
    },
    {
      "id": 6,
      "title": "Building a Responsive Navbar",
      "date": "2024-09-20",
      "body": "Creating a responsive navbar involves using CSS techniques to ensure the navigation menu adapts to different screen sizes. Media queries and flexible layouts are key to achieving a responsive design."
    },
    {
      "id": 7,
      "title": "Exploring TypeScript",
      "date": "2024-09-25",
      "body": "TypeScript is a superset of JavaScript that adds static types. It helps catch errors early through type checking and offers improved code readability and maintainability."
    },
    {
      "id": 8,
      "title": "Async/Await in JavaScript",
      "date": "2024-10-01",
      "body": "Async/Await is a feature in JavaScript that simplifies working with asynchronous code. It allows you to write asynchronous code that looks and behaves like synchronous code."
    },
    {
      "id": 9,
      "title": "Introduction to GraphQL",
      "date": "2024-10-05",
      "body": "GraphQL is a query language for APIs that allows clients to request only the data they need. It provides a more efficient, flexible, and powerful alternative to REST."
    },
    {
      "id": 10,
      "title": "Designing with Flexbox",
      "date": "2024-10-10",
      "body": "Flexbox is a CSS layout module that makes it easier to design flexible and responsive layout structures. It allows you to align and distribute space among items in a container."
    },
    {
      "id": 11,
      "title": "Introduction to Server-Side Rendering",
      "date": "2024-10-15",
      "body": "Server-Side Rendering (SSR) is a technique where the HTML of a web page is generated on the server and sent to the client. This can improve performance and SEO compared to client-side rendering."
    },
    {
      "id": 12,
      "title": "Understanding WebSockets",
      "date": "2024-10-20",
      "body": "WebSockets provide a full-duplex communication channel over a single TCP connection. They enable real-time interaction between clients and servers, making them ideal for applications like chat and live updates."
    }
  ]
}